---
kind: type
id: T:Autodesk.Revit.DB.TableCellStyle
source: html/e9a5280b-4009-004f-57a4-af1f292f9619.htm
---
# Autodesk.Revit.DB.TableCellStyle

The TableCellStyle class contains the appearance settings for a given table cell, column, or table.

## Syntax (C#)
```csharp
public class TableCellStyle : IDisposable
```